Tekla.Structures.Model.BaseRebarGroup.ExcludeTypeEnum
The different ways to exclude reinforcing bars from the group.

Tekla.Structures.Model.BaseRebarGroup.ExcludeTypeEnum.EXCLUDE_TYPE_NONE
All the reinforcing bars are included.

Tekla.Structures.Model.BaseRebarGroup.ExcludeTypeEnum.EXCLUDE_TYPE_FIRST
The first reinforcing bar is not to be created to the group.

Tekla.Structures.Model.BaseRebarGroup.ExcludeTypeEnum.EXCLUDE_TYPE_LAST
The last reinforcing bar is not to be created to the group.

Tekla.Structures.Model.BaseRebarGroup.ExcludeTypeEnum.EXCLUDE_TYPE_BOTH
The first and last reinforcing bars are not to be created to the group.